UT_Marketplaces.Marketplaces/src/Documents/ЗаказКлиента/ЗаказКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="1ceef4a2-6b58-45a0-8a75-bb6e3004590f">
  <name>ЗаказКлиента</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>рар_мп_АккаунтМаркетплейса</name>
    <type>
      <types>CatalogRef.рар_мп_АккаунтыМаркетплейсов</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="872dcece-786c-416e-bfa4-4ce98df56dd6">
    <name>НомерПоДаннымКлиента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>рар_мп_ЯндексМаркет_СтатусЗаказа</name>
    <type>
      <types>EnumRef.рар_мп_ЯндексМаркет_СтатусыЗаказов</types>
    </type>
  </attributes>
  <attributes>
    <name>рар_мп_ЯндексМаркет_ПодстатусЗаказа</name>
    <type>
      <types>EnumRef.рар_мп_ЯндексМаркет_ПодстатусыЗаказов</types>
    </type>
  </attributes>
  <attributes>
    <name>рар_мп_УникальныйИдентификаторСклада</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>рар_мп_Wildberries_СтатусЗаказа</name>
    <type>
      <types>EnumRef.рар_мп_Wildberries_СтатусыЗаказов</types>
    </type>
  </attributes>
  <attributes>
    <name>рар_мп_Wildberries_СтатусОбработкиЗаказа</name>
    <type>
      <types>EnumRef.рар_мп_Wildberries_СтатусыОбработкиЗаказов</types>
    </type>
  </attributes>
  <attributes>
    <name>рар_мп_Ozon_СтатусЗаказа</name>
    <type>
      <types>EnumRef.рар_мп_Ozon_СтатусыЗаказов</types>
    </type>
  </attributes>
  <attributes>
    <name>рар_мп_Ozon_ПодстатусЗаказа</name>
    <type>
      <types>EnumRef.рар_мп_Ozon_ПодстатусыЗаказов</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="d462888a-fa46-4e10-842a-8647c5c2ab42">
    <name>ДатаОтгрузки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="21767e3f-5e9d-43d3-803c-eaf6279e10db">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>рар_мп_СтатусДокументаВТСД</name>
    <type>
      <types>EnumRef.рар_мп_СтатусыДокументовВТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>рар_мп_ПользовательТСД</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>рар_мп_ТоварыДляМаркировки</name>
    <attributes>
      <name>рар_мп_СтрокаИзТЧТовары</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_IDТовара</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_ЗаполнениеМаркировки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_Exemplar_Id</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_ЧестныйЗнак</name>
      <type>
        <types>CatalogRef.ШтрихкодыУпаковокТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_ЗаполнениеГТД</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>рар_мп_НомерГТД</name>
      <type>
        <types>CatalogRef.НомераГТД</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="7b526229-3286-418a-920a-ff15a9b3ec48">
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="da473af6-1960-4683-b941-b8e3988be4fb">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ea68fa0a-5188-4f2e-b04a-9834dbc8adaa">
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="89c8c32c-ef8a-46f1-a7b4-75b2e1524d3f">
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

UT_Marketplaces.Marketplaces/src/Enums/рар_мп_Маркетплейсы/рар_мп_Маркетплейсы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>рар_мп_Маркетплейсы</name>
  <enumValues>
    <name>OZON</name>
  </enumValues>
  <enumValues>
    <name>ЯндексМаркет</name>
  </enumValues>
  <enumValues>
    <name>Wildberries</name>
  </enumValues>
</mdclass:Enum>

UT_Marketplaces.Marketplaces/src/Documents/ЗаказКлиента/Forms/ФормаДокумента/Module.bsl
//@skip-check module-structure-method-in-regions
&НаСервере
Процедура рар_мп_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	Если ЗначениеЗаполнено(Объект.рар_мп_АккаунтМаркетплейса) Тогда
				
		//@skip-check form-self-reference
		СтраницаСведенияОЗаказеИзМаркетплейса = ЭтаФорма.Элементы.Добавить("СведенияОЗаказеИзМаркетплейса", Тип("ГруппаФормы"), Элементы.ГруппаСтраницы);
		СтраницаСведенияОЗаказеИзМаркетплейса.Вид = ВидГруппыФормы.Страница;
		СтраницаСведенияОЗаказеИзМаркетплейса.Заголовок = "Маркетплейсы. Данные заказа";
		
		// ТСД ++ 
		//@skip-check form-self-reference
		ГруппаТСД = ЭтаФорма.Элементы.Добавить("ГруппаОбычная", Тип("ГруппаФормы"), Элементы["СведенияОЗаказеИзМаркетплейса"]);
		ГруппаТСД.Вид 		 		    = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаТСД.Отображение 		    = ОтображениеОбычнойГруппы.Нет;
		//alfedo++
		ГруппаТСД.Заголовок				= "Информация о документе в ТСД";
		ГруппаТСД.ОтображатьЗаголовок 	= Истина;
		ГруппаТСД.Группировка 		  	= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		ГруппаТСД.Поведение 			= ПоведениеОбычнойГруппы.Свертываемая;
		ГруппаТСД.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
		Элементы.ГруппаОбычная.Скрыть();
		//alfedo--
		//@skip-check form-self-reference
		НовыйЭлемент = ЭтаФорма.Элементы.Добавить("рар_мп_СтатусДокументаВТСД", Тип("ПолеФормы"),ГруппаТСД);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.рар_мп_СтатусДокументаВТСД";
		НовыйЭлемент.Заголовок = "Статус документа в ТСД";
		
		//@skip-check form-self-reference
		НовыйЭлемент = ЭтаФорма.Элементы.Добавить("рар_мп_ПользовательТСД", Тип("ПолеФормы"),ГруппаТСД);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.ПутьКДанным = "Объект.рар_мп_ПользовательТСД";
		НовыйЭлемент.Заголовок = "Пользователь взявший в работу в ТСД";
		// ТСД --

		//@skip-check bsl-variable-name-invalid
		рар_мп_АккаунтМаркетплейса = Элементы.Добавить("рар_мп_АккаунтМаркетплейса", Тип("ПолеФормы"), Элементы["СведенияОЗаказеИзМаркетплейса"]);
		рар_мп_АккаунтМаркетплейса.ПутьКДанным = "Объект.рар_мп_АккаунтМаркетплейса";
		рар_мп_АккаунтМаркетплейса.Вид = ВидПоляФормы.ПолеВвода;
		
		//@skip-check bsl-variable-name-invalid
		рар_мп_УникальныйИдентификаторСклада = Элементы.Добавить("рар_мп_УникальныйИдентификаторСклада",
																				Тип("ПолеФормы"),Элементы["СведенияОЗаказеИзМаркетплейса"]);
		рар_мп_УникальныйИдентификаторСклада.ПутьКДанным = "Объект.рар_мп_УникальныйИдентификаторСклада";
		рар_мп_УникальныйИдентификаторСклада.Вид = ВидПоляФормы.ПолеВвода; 
		
		//@skip-check bsl-variable-name-invalid
		рар_мп_НомерПоДаннымКлиента = Элементы.Добавить("рар_мп_НомерПоДаннымКлиента",Тип("ПолеФормы"),Элементы["СведенияОЗаказеИзМаркетплейса"]);
		рар_мп_НомерПоДаннымКлиента.ПутьКДанным = "Объект.НомерПоДаннымКлиента";
		рар_мп_НомерПоДаннымКлиента.Вид = ВидПоляФормы.ПолеВвода;
		рар_мп_НомерПоДаннымКлиента.Заголовок = "Номер заказа из маркетплейса"; 
				
		//@skip-check bsl-legacy-check-string-literal
		Маркетплейс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.рар_мп_АккаунтМаркетплейса, "Маркетплейс");
		
		Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
		
			//@skip-check bsl-variable-name-invalid
			рар_мп_Ozon_СтатусЗаказа = Элементы.Добавить("рар_мп_Ozon_СтатусЗаказа",Тип("ПолеФормы"),Элементы["СведенияОЗаказеИзМаркетплейса"]);
			рар_мп_Ozon_СтатусЗаказа.ПутьКДанным = "Объект.рар_мп_Ozon_СтатусЗаказа";
			рар_мп_Ozon_СтатусЗаказа.Вид = ВидПоляФормы.ПолеВвода;
			
			//@skip-check bsl-variable-name-invalid
			рар_мп_Ozon_ПодстатусЗаказа = Элементы.Добавить("рар_мп_Ozon_ПодстатусЗаказа",Тип("ПолеФормы"),Элементы["СведенияОЗаказеИзМаркетплейса"]);
			рар_мп_Ozon_ПодстатусЗаказа.ПутьКДанным = "Объект.рар_мп_Ozon_ПодстатусЗаказа";
			рар_мп_Ozon_ПодстатусЗаказа.Вид = ВидПоляФормы.ПолеВвода;
		
		ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда  
			
			//@skip-check bsl-variable-name-invalid
			рар_мп_ЯндексМаркет_СтатусЗаказа = Элементы.Добавить("рар_мп_ЯндексМаркет_СтатусЗаказа",
																  Тип("ПолеФормы"),Элементы["СведенияОЗаказеИзМаркетплейса"]);
			рар_мп_ЯндексМаркет_СтатусЗаказа.ПутьКДанным = "Объект.рар_мп_ЯндексМаркет_СтатусЗаказа";
			рар_мп_ЯндексМаркет_СтатусЗаказа.Вид = ВидПоляФормы.ПолеВвода;
			
			//@skip-check bsl-variable-name-invalid
			рар_мп_ЯндексМаркет_ПодстатусЗаказа = Элементы.Добавить("рар_мп_ЯндексМаркет_ПодстатусЗаказа",
																	 Тип("ПолеФормы"),Элементы["СведенияОЗаказеИзМаркетплейса"]);
			рар_мп_ЯндексМаркет_ПодстатусЗаказа.ПутьКДанным = "Объект.рар_мп_ЯндексМаркет_ПодстатусЗаказа";
			рар_мп_ЯндексМаркет_ПодстатусЗаказа.Вид = ВидПоляФормы.ПолеВвода;	
			
		ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
			
			//@skip-check bsl-variable-name-invalid
			рар_мп_Wildberries_СтатусЗаказа = Элементы.Добавить("рар_мп_Wildberries_СтатусЗаказа",
																 Тип("ПолеФормы"),Элементы["СведенияОЗаказеИзМаркетплейса"]);
			рар_мп_Wildberries_СтатусЗаказа.ПутьКДанным = "Объект.рар_мп_Wildberries_СтатусЗаказа";
			рар_мп_Wildberries_СтатусЗаказа.Вид = ВидПоляФормы.ПолеВвода;
			
			//@skip-check bsl-variable-name-invalid
			рар_мп_Wildberries_СтатусОбработкиЗаказа = Элементы.Добавить("рар_мп_Wildberries_СтатусОбработкиЗаказа",
																		  Тип("ПолеФормы"),Элементы["СведенияОЗаказеИзМаркетплейса"]);
			рар_мп_Wildberries_СтатусОбработкиЗаказа.ПутьКДанным = "Объект.рар_мп_Wildberries_СтатусОбработкиЗаказа";
			рар_мп_Wildberries_СтатусОбработкиЗаказа.Вид = ВидПоляФормы.ПолеВвода;
			
		КонецЕсли;
		
		//НоваяКоманда = ЭтаФорма.Команды.Добавить("ОтменитьЗаказНаМаркетплейсе");
		//НоваяКоманда.Действие = "ОтменитьЗаказНаМаркетплейсе";
		//НоваяКоманда.Заголовок = "Отменить заказ на маркетплейсе";
		//
		//НоваяКнопка = Элементы.Добавить("Кнопка_ОтменитьЗаказНаМаркетплейсе", Тип("КнопкаФормы"), Элементы["СведенияОЗаказеИзМаркетплейса"]);
		//НоваяКнопка.ИмяКоманды = "ОтменитьЗаказНаМаркетплейсе";
		
		//@skip-check bsl-variable-name-invalid
		рар_мп_ТоварыДляМаркировки = Элементы.Добавить("рар_мп_ТоварыДляМаркировки", Тип("ТаблицаФормы"), Элементы["СведенияОЗаказеИзМаркетплейса"]);
		рар_мп_ТоварыДляМаркировки.ПутьКДанным = "Объект.рар_мп_ТоварыДляМаркировки";
		рар_мп_ТоварыДляМаркировки.ИзменятьСоставСтрок = Ложь;
		
		//@skip-check bsl-variable-name-invalid
		рар_мп_СтрокаИзТЧТовары = Элементы.Добавить("рар_мп_СтрокаИзТЧТовары", Тип("ПолеФормы"), рар_мп_ТоварыДляМаркировки);
		рар_мп_СтрокаИзТЧТовары.Вид = ВидПоляФормы.ПолеВвода;
		рар_мп_СтрокаИзТЧТовары.ПутьКДанным = "Объект.рар_мп_ТоварыДляМаркировки.рар_мп_СтрокаИзТЧТовары";
		рар_мп_СтрокаИзТЧТовары.Заголовок = "№";
		рар_мп_СтрокаИзТЧТовары.ТолькоПросмотр = Истина;
		
		//@skip-check bsl-variable-name-invalid
		рар_мп_Номенклатура = Элементы.Добавить("рар_мп_Номенклатура", Тип("ПолеФормы"), рар_мп_ТоварыДляМаркировки);
		рар_мп_Номенклатура.Вид = ВидПоляФормы.ПолеВвода;
		рар_мп_Номенклатура.ПутьКДанным = "Объект.рар_мп_ТоварыДляМаркировки.рар_мп_Номенклатура";
		рар_мп_Номенклатура.Заголовок = "Номенклатура";
		рар_мп_Номенклатура.ТолькоПросмотр = Истина;
		
		//@skip-check bsl-variable-name-invalid
		рар_мп_Характеристика = Элементы.Добавить("рар_мп_Характеристика", Тип("ПолеФормы"), рар_мп_ТоварыДляМаркировки);
		рар_мп_Характеристика.Вид = ВидПоляФормы.ПолеВвода;
		рар_мп_Характеристика.ПутьКДанным = "Объект.рар_мп_ТоварыДляМаркировки.рар_мп_Характеристика";
		рар_мп_Характеристика.Заголовок = "Характеристика";
		рар_мп_Характеристика.ТолькоПросмотр = Истина;
		
		//@skip-check bsl-variable-name-invalid
		рар_мп_ЗаполнениеМаркировки = Элементы.Добавить("рар_мп_ЗаполнениеМаркировки", Тип("ПолеФормы"), рар_мп_ТоварыДляМаркировки);
		рар_мп_ЗаполнениеМаркировки.Вид = ВидПоляФормы.ПолеВвода;
		рар_мп_ЗаполнениеМаркировки.ПутьКДанным = "Объект.рар_мп_ТоварыДляМаркировки.рар_мп_ЗаполнениеМаркировки";
		рар_мп_ЗаполнениеМаркировки.Заголовок = "Заполнять маркировку";
		рар_мп_ЗаполнениеМаркировки.ТолькоПросмотр = Истина;
		
		//@skip-check bsl-variable-name-invalid
		рар_мп_ЧестныйЗнак = Элементы.Добавить("рар_мп_ЧестныйЗнак", Тип("ПолеФормы"), рар_мп_ТоварыДляМаркировки);
		рар_мп_ЧестныйЗнак.Вид = ВидПоляФормы.ПолеВвода;
		рар_мп_ЧестныйЗнак.ПутьКДанным = "Объект.рар_мп_ТоварыДляМаркировки.рар_мп_ЧестныйЗнак";
		рар_мп_ЧестныйЗнак.Заголовок = "Маркировка честный знак";
		
		//ГТД
		//@skip-check bsl-variable-name-invalid
		рар_мп_ЗаполнениеГТД = Элементы.Добавить("рар_мп_ЗаполнениеГТД", Тип("ПолеФормы"), рар_мп_ТоварыДляМаркировки);
		рар_мп_ЗаполнениеГТД.Вид = ВидПоляФормы.ПолеВвода;
		рар_мп_ЗаполнениеГТД.ПутьКДанным = "Объект.рар_мп_ТоварыДляМаркировки.рар_мп_ЗаполнениеГТД";
		рар_мп_ЗаполнениеГТД.Заголовок = "Заполнять ГТД";
		рар_мп_ЗаполнениеГТД.ТолькоПросмотр = Истина;
		
		//@skip-check bsl-variable-name-invalid
		рар_мп_НомерГТД = Элементы.Добавить("рар_мп_НомерГТД", Тип("ПолеФормы"), рар_мп_ТоварыДляМаркировки);
		рар_мп_НомерГТД.Вид = ВидПоляФормы.ПолеВвода;
		рар_мп_НомерГТД.ПутьКДанным = "Объект.рар_мп_ТоварыДляМаркировки.рар_мп_НомерГТД";
		рар_мп_НомерГТД.Заголовок = "Номер ГТД";
		//ГТД
		
		Если НЕ УправлениеДоступом.ЕстьРоль("ПолныеПрава") Тогда
		
			рар_мп_АккаунтМаркетплейса.ТолькоПросмотр 			= Истина;
			рар_мп_УникальныйИдентификаторСклада.ТолькоПросмотр = Истина;
			рар_мп_НомерПоДаннымКлиента.ТолькоПросмотр 			= Истина;
			
			Если Маркетплейс = Перечисления.рар_мп_Маркетплейсы.OZON Тогда
		
				рар_мп_Ozon_СтатусЗаказа.ТолькоПросмотр    = Истина;
				рар_мп_Ozon_ПодстатусЗаказа.ТолькоПросмотр = Истина;
			
			ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.ЯндексМаркет Тогда  
				
				рар_мп_ЯндексМаркет_СтатусЗаказа.ТолькоПросмотр    = Истина;
				рар_мп_ЯндексМаркет_ПодстатусЗаказа.ТолькоПросмотр = Истина;	
				
			ИначеЕсли Маркетплейс = Перечисления.рар_мп_Маркетплейсы.Wildberries Тогда
				
				рар_мп_Wildberries_СтатусЗаказа.ТолькоПросмотр    		= Истина;
				рар_мп_Wildberries_СтатусОбработкиЗаказа.ТолькоПросмотр = Истина;
				
			КонецЕсли;
			
			Элементы.НомерПоДаннымКлиента.ТолькоПросмотр = Истина;			
		
		КонецЕсли;
	
	КонецЕсли;
КонецПроцедуры

//&НаКлиенте
//Процедура ОтменитьЗаказНаМаркетплейсе(Команда)
//
//	Сообщить("Данный механизм пока не реализован");	
//
//КонецПроцедуры
